# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Ian\Documents\Junior\Chip-Design\proj_asic\psoc\Wave Generator\Wave Generator.cydsn\Wave Generator.cyprj
# Date: Tue, 22 Mar 2016 23:41:43 GMT
#set_units -time ns
create_clock -name {ADC_SAR_theACLK(routed)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {WaveDAC8_DacClk(routed)} -period 20833.333333333332 -waveform {0 10416.6666666667} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC_SAR_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {I2S_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 9 17} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {WaveDAC8_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 501 1001} -nominal_period 20833.333333333332 [list [get_pins {ClockBlock/dclk_glb_3}]]


# Component constraints for C:\Users\Ian\Documents\Junior\Chip-Design\proj_asic\psoc\Wave Generator\Wave Generator.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Ian\Documents\Junior\Chip-Design\proj_asic\psoc\Wave Generator\Wave Generator.cydsn\Wave Generator.cyprj
# Date: Tue, 22 Mar 2016 23:41:33 GMT
